cases/chpt4-tin-CC-506-b/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// This is for gallium in cavity

alpha1TControl 1.0;
alphaInterfaceCut 1e6;
alpha2Capture 0.125;

//phases (Phase1 Phase2);

phases (Phase1 Phase2 Phase3);

phaseChangeTwoPhaseMixture Weld;

pSat            0;   // Saturation pressure
pMin            0; 

sigma           0;//.05;//.01;//.3;//0.07;
sigma12         0;
sigma13         0;
sigma23         0;
D23             0;

k [1 1 -3 -1 0 0 0] 1;
nuEM 1;
nu [0 2 -1 0 0 0 0] 2.98e-07;
rho [1 -3 0 0 0 0 0] 1000;
cp [0 2 -2 -1 0 0 0] 1000;

//k k [1 1 -3 1 0 0 0] 1; // kg*m/s^3*k
/*
k1 0;//0.02;
k2 32;//24; //24 liquid, 40 solid?
k3  32;//40;//40;
*/
k_weld 0;//40; 

multiplierBuoy 5e9;
multiplierBuoyG 0;
sourceTime 0;

dmdtRelaxAlpha 3.5;
dmdtRelaxPressure 0;
/*
cp1 [0 2 -2 -1 0 0 0] 381.5;//1000;
cp2 [0 2 -2 -1 0 0 0] 381.5;
cp3 [0 2 -2 -1 0 0 0] 381.5;
*/
SuFudge 0;
testFudge 1;

dsigmadT 0;

meltingT 505.1;

T_0 505.1;

//cp cp [0 2 -2 -1 0 0 0] 381.5;

rhoRef 6.98e3;

htot htot [1 -1 -2 0 0 0 0] 1;

Lf 59219;//60.6e3; 

Tref 505.1;//302.93; // 29.78 C

beta 0;//210e-6;

vsfRho true;
//LfSmoothing true;
// Phase prop match stops spurious - reweight???
/*
phases
(
*/
Phase1 // air
{
    transportModel  Newtonian;
    nu              1.48e-05;
    rho             1.1;
    cp              cp [ 0 2 -2 -1 0 0 0] 1000;
    k               k [ 1 1 -3 -1 0 0 0] 0.02;
}

Phase2 // liquid
{
//&10.204+32.063(T273.15)&5.686(T273.15)2

    transportModel  Newtonian;
    nu              2.81e-7;
    rho             6.98e3;   
    Tref            505.1;
    beta            1.06e-4;// 210e-6; // 
    cp              228.3885;//2.57e2;
    k               30;
    k2Opt           true;
    k2a             10.204;
    k2b             32.063;
    k2c             5.686;
}

Phase3 // solid
{
    transportModel  Newtonian;
    nu              2.97e-07;
    rho             7.5e3;
    cp              228.3885;//2.57e2;
    k               30;
    k3Opt           true;
    k3a             10.204;
    k3b             32.063;
    k3c             5.686;
}


// ************************************************************************* //
